############## 1 ##############

print("Задача 1")
x=int(input())
y=int(input())
if x < 4:
  print("Первая область")
else:
  print("Вторая область")
  
############## 2 ##############

print("Задача 2")
x=int(input())
y=int(input())
if y > 3:
  print("Первая область")
else:
  print("Вторая область")
  
############## 3 ##############

print("Задача 3")
a=int(input())
if a>2:
  print(2)
else:
  print(a)
  
############## 4 ##############

print("Задача 4")
n4 = float(input("Введите первое число: "))
n44 = float(input("Введите второе число: "))
if n4 > n44:
    print(n4, '- большее числоn', n44, '- меньшее число')
elif n44 > n4:
    print(n44, '- большее числоn', n4, '- меньшее число')
    
############## 5 ##############

print("Задача 5")
a5 = int(input("Введите первое число: "))
b5 = int(input("Введите второе число: "))
print((a5 + b5 - abs(a5 - b5)) / 2)
print((a5 + b5 + abs(a5 - b5)) / 2)

############## 6 ##############

print("Задача 6")
y1 = int(input())
m1 = int(input())
y2 = int(input())
m2 = int(input())
print(((y2 - y1) * 12 + m2 - m1) // 12)

############## 7 ##############

print("Задача 7")
from math import sin
x7 = int(input("x="))
if x7 > 0:
    y7 = sin(x7)**2
else:
    y7 = 1 - (2 * sin(x7 * x7))
print(y7)

############## 8 ##############

print("Задача 8")
from math import sin
x = int(input())
if x>0:
  print(sin(x**2))
else:
  print(1+2*sin(x)**2)


############## 9 ##############

print("Задача 9")
b9 = int(input())
a9 = int(input())
if b9 % a9 == 0:
    print ("да")
else:
    print ("нет")
    
############## 10 ##############

print("Задача 10")
n10 = int(input())
if n10 % 2 == 0:
    print('Число четное')
else:
    print('Число нечетное')
 
if n10 % 10 == 7:
    print('Число оканчивается на 7')
else:
    print('Число не оканчивается на 7')
    
############## 11 ##############

print("Задача 11")
n11 = int(input())
max1 = max(n % 10, n // 10)
check = False
if max1 == n11 // 10 != n11 % 10:
    check = True
    print('Первая цифра числа больше')
elif max1 == n11 % 10 != n11 // 10:
    check = True
    print('Вторая цифра числа больше')
if not check:
    print('Цифры числа одинаковы')
else:
    print('Цифры числа различны')

############## 12 ##############

print("Задача 12")
n12 = input("Введите целое трехзначное число: ")
if n12 == n12[2]+n12[1]+n12[0]:
    print("Палиндром")
else:
    print("Не палиндром")
    
############## 13 ##############

print("Задача 13")
num = int(input('Введите число: '))
number_1 = num // 100
number_2 = num // 10 % 10
number_3 = num % 10
if number_1 == number_2 == number_3:
    print('a) Да')
else:
    print('a) Нет')
if number_1 == number_2 or number_1 == number_3 or number_2 == number_3:
    print('б) Да')
else:
    print('б) Нет')
    
############## 14 ##############

print("Задача 14")
n14 = int(input('Введите число: '))
a14 = n14 % 10 % 2 == 0
b14 = n14 % 10 % 2 != 0
print('а)',a14)
print('б)',b14)

############## 15 ##############

print("Задача 15")
print('Зеленый' if 0 <= float(input()) % 5 <= 3 else 'Красный')

############## 16 ##############

print("Задача 16")
M16 = int(input("Введите массу в килограммах (M): "))
m16 = int(M16 / 1000)
print("Количество полных тонн: ", m16)

############## 17 ##############

print("Задача 17")
a = 543
b = 130
print(a//b)

############## 18 ##############

print("Задача 18 не сделана")

############## 19 ##############

print("Задача 19")
a = int(input())
b=a//100%10
c=a//10%10
d=a%10
print(d,c,b,sep='')

############## 20 ##############

print("Задача 20")
a = int(input())
b=a//100%10
c=a//10%10
d=a%10
print(c,d,b, sep = '')

############## 21 ##############

print("Задача 21")
a = int(input())
b=a//100%10
c=a//10%10
d=a%10
print(d,b,c, sep = '')

############## 22 ##############

print("Задача 22")
a = int(input())
b=a//100%10
c=a//10%10
d=a%10
print(c,b,d, sep = '')

############## 23 ##############

print("Задача 23")
a = int(input())
b=a//100%10
c=a//10%10
d=a%10
print(b,d,c, sep = '')

############## 24 ##############

print("Задача 24")
abc = int(input())
c = abc % 10
b = (abc % 100) // 10
a = abc // 100
print(a, b, c, sep ='')
print(a,c,b, sep='')
print(b,a,c, sep='')
print(b,c,a, sep='')
print(c,a,b, sep='')
print(c,b,a, sep='')

############## 25 ##############

print("Задача 25")
a=int(input())
b = a//10%10
c = a%10
print(c)
print(b)

############## 26 ##############

print("Задача 26 не сделана")

############## 27 ##############

print("Задача 27 не сделана")

############## 28 ##############

print("Задача 28 не сделана")

############## 29 ##############

print("Задача 29 не сделана")

############## 30 ##############

print("Задача 30 не сделана")

############## 31 ##############

print("Задача 31 не сделана")

############## 32 ##############

print("Задача 32 не сделана")

############## 33 ##############

print("Задача 33 не сделана")

############## 34 ##############

print("Задача 34")
a, b, c, d = int(input()), int(input()), int(input()), int(input())
if a == c or b == d:
    print('YES')
else:
    print('NO')

############## 35 ##############

print("Задача 35")
x=int(input())
y=int(input())
if x >= -1 and y <= -2:
  print("Попадает в область")
else:
  print("Не попадает")
